# Basic Functions

### Preliminary Stuff

In [2]:
# The following modules are used for plotting and generating data
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd
%matplotlib inline

In [4]:
# import the dataset
df = pd.read_csv('data/titanic.csv')
df.tail(3)

     Survived  Pclass     Sex   Age   Fare     Embarked
709         1       1  female  19.0  30.00  Southampton
710         1       1    male  26.0  30.00    Cherbourg
711         0       3    male  32.0   7.75   Queenstown

### Python has lots of built-in functions

https://docs.python.org/3/library/functions.html  
Remember, all of these names are 'reserved' so don't use them as names for your own variables or functions!

In [29]:
len('Southampton')

11

In [28]:
list('Southampton')

['S', 'o', 'u', 't', 'h', 'a', 'm', 'p', 't', 'o', 'n']

In [32]:
seasons = list(('Spring', 'Summer', 'Fall', 'Winter'))
seasons

['Spring', 'Summer', 'Fall', 'Winter']

In [35]:
# Of course you can combine these!
print(len(list(enumerate(seasons))))
list(enumerate(seasons, start=1))

4

[(1, 'Spring'), (2, 'Summer'), (3, 'Fall'), (4, 'Winter')]

## Write a Simple Function

In [6]:
# Write a simple function that has no arguments:
def dicaprio():
    print('Jack Dawson')
    
# Call the function:
dicaprio()

Jack Dawson

In [10]:
# Write a function that takes one user input as an argument:
def winslet(youranswer):
    return youranswer # Notice that we use 'return' instead of 'print'! 
    
# Call the function:
winslet('Rose DeWitt')

'Rose Dawson'

In [13]:
# Write a number function with 2 arguments.
def add_num(num1,num2):
    return num1+num2

# How old is Rose in 1996?
add_num(17,83)

100

Additional Resource: https://chrisalbon.com/python/basics/function_basics/

In [37]:
# Now try it out yourself!

## Combine simple functions with pandas

In [39]:
# Apply a built-in function to every row of the Titanic dataframe.
df['port_length'] = df['Embarked'].apply(len)
df.tail(3)

     Survived  Pclass     Sex   Age   Fare     Embarked  port_length
709         1       1  female  19.0  30.00  Southampton           11
710         1       1    male  26.0  30.00    Cherbourg            9
711         0       3    male  32.0   7.75   Queenstown           10

In [44]:
# Write a number function that calculates passengers' age in 1996.
def whitestar_lines(num1):
    return num1+84

# Try it out!
whitestar_lines(1912)

1996

In [45]:
# Apply your function to every row of the dataframe.
df['Age_1996'] = df['Age'].apply(whitestar_lines)
df.tail(3)

     Survived  Pclass     Sex   Age   Fare     Embarked  port_length  Age_1996
709         1       1  female  19.0  30.00  Southampton           11     103.0
710         1       1    male  26.0  30.00    Cherbourg            9     110.0
711         0       3    male  32.0   7.75   Queenstown           10     116.0

## Now you try it out! 
Trivia: 
According to the Bureau of Labor Statistics consumer price index, prices in 2018 are 2,498.00% higher than prices in 1912. So \$100 in 1912 would be worth \$2,598 in 2018.    
http://www.in2013dollars.com/1912-dollars-in-2018

In [ ]:
# Write a function that calculates how much fare would cost in today's dollars
def

In [46]:
# Now apply your function to all the fares in the dataframe.

Additional Resource:  
https://chrisalbon.com/python/data_wrangling/pandas_apply_function_by_group/